MESSAGES = {
    "no_auth": "⛔ Извините, я вас не знаю. Мне сказали не разговаривать с незнакомцами 😕",
    "start": "Отправь сюда файл или фото, и я его распечатаю. Можно сразу несколько 🙂",
    "downloading_file": "⤵️ Загружаю файл {filename}",
    "preparing_file": "⚙️ Готовлю файл к печати",
    # TODO: Word endings (страниц)
    "page_count_warning": "⚠️ В документе {filename} {pages} страниц. Печатаем? Нажми Да или Нет под этим сообщением",
    "sent_to_printer": "🖨️ Отправил на печать 👍",
    "unprintable": "❌ Не могу напечатать твой файл 😞 Я умею печатать только PDF, Word, Excel и прочие офисные документы, или фото.",
    "printing_failed": "❌ Не удалось напечатать 😞 Принтер отказался ⛔",
    "status_failed": "❌ Не удалось получить от принтера очередь печати 😞",
    "print_queue": "🖨️ Очередь печати:\n{queue}",
    "empty_queue": "🗌 Очередь печати пуста",
    "failed": "❌ Что-то пошло не так 😞 Ошибка: {err}",
}
